#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`

Show Plan

```terraform
data.cloudflare_zone.lilja_dot_io: Reading...
data.cloudflare_zone.lilja_dot_io: Read complete after 1s [id=801ec7bc35b2abc9580d847c7b5c6f56]
module.cloudflare_lilja_io_setup.cloudflare_record.txt_records["_dmarc"]: Refreshing state... [id=34dcc8e8ec712be680b004d4071f5a89]
module.cloudflare_lilja_io_setup.cloudflare_record.txt_records["protonmail-verification=9a69211edf7217e6d5f99e5507b53feb1b356f0d"]: Refreshing state... [id=91f6606f599ea13775f2eab5d362c384]
module.cloudflare_lilja_io_setup.cloudflare_record.txt_records["v=spf1 include:_spf.protonmail.ch mx ~all"]: Refreshing state... [id=27880e7ae87be1c5dcdde52d5763dfb4]
module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_mail["mail.protonmail.ch"]: Refreshing state... [id=17f1e94ab3576c93296900f09c2cad2f]
module.cloudflare_lilja_io_setup.cloudflare_record.cname_dkim1["protonmail2._domainkey"]: Refreshing state... [id=ddb7f0e8bcc1a92e83459eb5643e2827]
module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_mail["mailsec.protonmail.ch"]: Refreshing state... [id=2b9dab6700df6f8a389c327483b1a045]
module.cloudflare_lilja_io_setup.cloudflare_record.cname_dkim1["protonmail._domainkey"]: Refreshing state... [id=cd3bbd6e0352097c0c5651ff95a37988]
module.cloudflare_lilja_io_setup.cloudflare_record.cname_dkim1["protonmail3._domainkey"]: Refreshing state... [id=e8665c888f0006a9b36f38ae80b860d1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_mail["mail.protonmail.ch"] must be replaced
-/+ resource "cloudflare_record" "mx_proton_mail" {
      ~ created_on      = "2025-02-01T20:41:00.745141Z" -> (known after apply)
      ~ hostname        = "lilja.io" -> (known after apply)
      ~ id              = "17f1e94ab3576c93296900f09c2cad2f" -> (known after apply)
      ~ metadata        = {} -> (known after apply)
      ~ modified_on     = "2025-02-01T20:41:00.745141Z" -> (known after apply)
      ~ name            = "lilja.io" -> "@" # forces replacement
      ~ proxiable       = false -> (known after apply)
      - tags            = [] -> null
      + value           = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_mail["mailsec.protonmail.ch"] must be replaced
-/+ resource "cloudflare_record" "mx_proton_mail" {
      ~ created_on      = "2025-02-01T20:40:59.979317Z" -> (known after apply)
      ~ hostname        = "lilja.io" -> (known after apply)
      ~ id              = "2b9dab6700df6f8a389c327483b1a045" -> (known after apply)
      ~ metadata        = {} -> (known after apply)
      ~ modified_on     = "2025-02-01T20:40:59.979317Z" -> (known after apply)
      ~ name            = "lilja.io" -> "@" # forces replacement
      ~ proxiable       = false -> (known after apply)
      - tags            = [] -> null
      + value           = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.txt_dmarc has moved to module.cloudflare_lilja_io_setup.cloudflare_record.txt_records["_dmarc"]
    resource "cloudflare_record" "txt_records" {
        id              = "34dcc8e8ec712be680b004d4071f5a89"
        name            = "_dmarc"
        tags            = []
        # (12 unchanged attributes hidden)
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.txt_records["lilja.io"] will be created
  + resource "cloudflare_record" "txt_records" {
      + allow_overwrite = false
      + content         = "v=spf1 include:_spf.protonmail.ch mx ~all"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "lilja.io"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.txt_records["protonmail-verification=9a69211edf7217e6d5f99e5507b53feb1b356f0d"] will be destroyed
  # (because key ["protonmail-verification=9a69211edf7217e6d5f99e5507b53feb1b356f0d"] is not in for_each map)
  # (moved from module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_protomain_verification)
  - resource "cloudflare_record" "txt_records" {
      - allow_overwrite = false -> null
      - content         = "protonmail-verification=9a69211edf7217e6d5f99e5507b53feb1b356f0d" -> null
      - created_on      = "2025-02-01T20:40:56.728774Z" -> null
      - hostname        = "lilja.io" -> null
      - id              = "91f6606f599ea13775f2eab5d362c384" -> null
      - metadata        = {} -> null
      - modified_on     = "2025-02-01T20:40:56.728774Z" -> null
      - name            = "lilja.io" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" -> null
        # (1 unchanged attribute hidden)
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.txt_records["v=spf1 include:_spf.protonmail.ch mx ~all"] will be destroyed
  # (because key ["v=spf1 include:_spf.protonmail.ch mx ~all"] is not in for_each map)
  # (moved from module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_spf1)
  - resource "cloudflare_record" "txt_records" {
      - allow_overwrite = false -> null
      - content         = "v=spf1 include:_spf.protonmail.ch mx ~all" -> null
      - created_on      = "2025-02-01T20:40:59.49959Z" -> null
      - hostname        = "lilja.io" -> null
      - id              = "27880e7ae87be1c5dcdde52d5763dfb4" -> null
      - metadata        = {} -> null
      - modified_on     = "2025-02-01T20:40:59.49959Z" -> null
      - name            = "lilja.io" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" -> null
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 0 to change, 4 to destroy.
```

*Pusher: @jlilja, Action: `pull_request`, Workflow: `Plan Terraform code on PR`*